{
    "url": "https://es.wikipedia.org/wiki/Recuperaci%C3%B3n_de_informaci%C3%B3n",
    "title": "Búsqueda y recuperación de información",
    "summary": "Busca fuentes: «Búsqueda y recuperación de información» – noticias · libros · académico · imágenes\nLa búsqueda y recuperación de información es la ciencia de la búsqueda de información en documentos electrónicos y cualquier tipo de colección documental digital, encargada de la búsqueda dentro de estos mismos, búsqueda de metadatos que describan documentos, o también la búsqueda en bases de datos relacionales, ya sea a través de internet, una intranet, y como objetivo realiza la recuperación en textos, imágenes, sonido o datos de otras características, de manera pertinente y relevante.\nLa recuperación de información es un estudio interdisciplinario. Cubre tantas disciplinas que eso genera normalmente un conocimiento parcial desde tan solo una u otra perspectiva. Algunas de las disciplinas que se ocupan de estos estudios son la psicología cognitiva, la arquitectura de la información, diseño de la información, inteligencia artificial, lingüística, semiótica, informática, biblioteconomía, archivística y documentación.\nPara alcanzar su objetivo de recuperación se sustenta en los sistemas de información, y al ser de carácter multidisciplinario intervienen bibliotecólogos para determinar criterio de búsqueda, la relevancia y pertinencia de los términos, en conjunto con la informática.\n",
    "sections": [
        {
            "name": "Historia",
            "text": "La idea del uso de computadoras para la búsqueda de trozos relevantes de información se popularizó a raíz de un artículo As We May Think de Vannevar Bush en el año 1945.[1]​ Los primeros sistemas automatizados de recuperación de la información fueron presentados durante la década de 1950 a 1960. Durante 1970 se realizaron pruebas a un grupo de textos como la colección Cranfield para un gran número de distintas técnicas cuyo rendimiento fue bueno.[1]​ Los sistemas de recuperación a larga escala, como el Sistema de Diálogo Lockheed, comenzaron a utilizarse a principios de 1970.   \nEn 1992, el Departamento de Defensa de los Estados Unidos conjuntamente con el Instituto Nacional de Estándares y Tecnología (NIST por su sigla en inglés), patrocinaron la Conferencia de Recuperación de Texto (TREC) como parte del programa TIPSTER. Esto proveyó ayuda desde la comunidad de recuperación de la información al suministrar la infraestructura necesaria para la evaluación de metodologías de recuperación de texto en una colección a larga escala. La introducción de motores de búsqueda ha elevado aún más la necesidad de sistemas de recuperación con mayor capacidad.  \nEl uso de métodos digitales para almacenar y recuperar información ha desembocado en el denominado fenómeno de la obsolescencia digital, que sucede cuando una fuente digital deja de ser accesible porque sus medio físico, el lector utilizado para la lectura de ese medio o el software que lo controla, ya no se encuentra disponible. La información, inicialmente es más fácil de recuperar en lugar de su fuente en papel, pero dicha información entonces, se pierde definitivamente.\nLos buscadores, tales como Google, Google Desktop Search, Lycos y Copernic, son algunas de las aplicaciones más populares para la recuperación de información. Básicamente hay que construir un Vocabulario, que es una lista de términos en lenguaje natural, un algoritmo que incluya las reglas lógicas de la búsqueda {Tabla de verdad} y una valoración de los resultados o cantidad de información lograda o posible. Este motor de búsqueda es pues el que permite\nplantear una pregunta con no menos de dos términos (en algunos casos pueden ser menos de dos términos) y mostrar los resultados mínimos y el logaritmo natural de las interacciones será alrededor de 789\nAlgunos de los estudiosos más destacados dentro de esta subdisciplina son Gerard Salton, W Bruce Croft, Karen Spärck Jones, Keith van Rijsbergen y Ricardo Baeza-Yates.\nA veces se plantean ciertos problemas a la hora de recuperar información provocados por el uso del lenguaje natural (entre otras razones) como el silencio (debido a la sinonimia), el ruido (debido a la polisemia), homografía, ambigüedad, etc.\n",
            "subsections": []
        },
        {
            "name": "Presentación",
            "text": "Un proceso de recuperación de información comienza cuando un usuario hace una consulta al sistema. Una consulta a su vez es una afirmación formal de la necesidad de una información. En la recuperación de información una consulta no identifica únicamente a un objeto dentro de la colección. De hecho varios objetos pueden ser respuesta a una consulta con diferentes grados de relevancia.\nUn objeto es una identidad que está representada por información en una base de datos. En dependencia de la aplicación estos objetos pueden ser archivos de texto, imágenes, audio, mapas, videos, etc. Muy a menudo los documentos no están almacenados en el sistema de recuperación de información, sino que están representados lógicamente.\nLa mayoría de los sistemas de recuperación de información computan un ranking para saber cuán bien cada objeto responde a la consulta, ordenando los objetos de acuerdo a su valor de ranking. Los objetos con mayor ranking son mostrados a los usuarios y el proceso puede tener otras iteraciones si el usuario desea refinar su consulta.\n",
            "subsections": []
        },
        {
            "name": "Medidas de rendimiento y correctitud",
            "text": "Muchas medidas han sido propuestas para evaluar el rendimiento de los sistemas de recuperación de información. Las medidas necesitan una colección de documentos y una consulta. A continuación serán descritas algunas medidas comunes, las cuales asumen que: cada documento se sabe que este es relevante o no relevante para una consulta particular. En la práctica pueden haber diferentes matices de relevancia.\n",
            "subsections": [
                {
                    "name": "Precisión",
                    "text": "La precisión es la fracción de documentos recuperados que son relevantes para la necesidad de información del usuario.\nPrecisión\n=\n|\n{\ndocumentos relevantes\n}\n∩\n{\ndocumentos recuperados\n}\n|\n|\n{\ndocumentos recuperados\n}\n|\n{\\displaystyle {\\mbox{Precisión}}={\\frac {|\\{{\\mbox{documentos relevantes}}\\}\\cap \\{{\\mbox{documentos recuperados}}\\}|}{|\\{{\\mbox{documentos recuperados}}\\}|}}}\nLa precisión tiene en cuenta todos los documentos recuperados. También puede ser evaluada en un corte determinado del ranking, considerando solamente los primeros resultados obtenidos del sistema. \nNótese que el significado y uso de la \"precisión\" en el campo de la Recuperación de Información, difiere de las definiciones de exactitud y precisión en otras ramas de la ciencia y la tecnología.\n--Exhaustividad--\nLa exhaustividad es la fracción de documentos relevantes para una consulta que fueron recuperados.\nExhaustividad\n=\n|\n{\ndocumentos relevantes\n}\n∩\n{\ndocumentos recuperados\n}\n|\n|\n{\ndocumentos relevantes\n}\n|\n{\\displaystyle {\\mbox{Exhaustividad}}={\\frac {|\\{{\\mbox{documentos relevantes}}\\}\\cap \\{{\\mbox{documentos recuperados}}\\}|}{|\\{{\\mbox{documentos relevantes}}\\}|}}}\nResulta trivial obtener un 100% de exhaustividad si se toman como respuesta para cualquier consulta todos los documentos de la colección. Por lo tanto, la exhaustividad sola no es suficiente, sino que se necesita también medir el número de documentos no relevantes, por ejemplo con el cálculo de la precisión.\n--Proposición de fallo--\nLa proposición de fallo, llamada en inglés fall-out, es la proporción de documentos no relevantes que son recuperados, fuera de todos los documentos relevantes disponibles.\nfall-out\n=\n|\n{\ndocumentos no relevantes\n}\n∩\n{\ndocumentos recuperados\n}\n|\n|\n{\ndocumentos no relevantes\n}\n|\n{\\displaystyle {\\mbox{fall-out}}={\\frac {|\\{{\\mbox{documentos no relevantes}}\\}\\cap \\{{\\mbox{documentos recuperados}}\\}|}{|\\{{\\mbox{documentos no relevantes}}\\}|}}}\nResulta trivial obtener un 0% de proposición de fallo si no se devuelve ningún documento de la colección para cualquier consulta.\n--Medida F--\nLa medida F es un balance de la precisión y el recobrado:\nF\n=\n2\n⋅\nP\nr\ne\nc\ni\ns\ni\no\nn\n⋅\nR\ne\nc\no\nb\nr\na\nd\no\n(\nP\nr\ne\nc\ni\ns\ni\no\nn\n+\nR\ne\nc\no\nb\nr\na\nd\no\n)\n.\n{\\displaystyle F={\\frac {2\\cdot \\mathrm {Precision} \\cdot \\mathrm {Recobrado} }{(\\mathrm {Precision} +\\mathrm {Recobrado} )}}.\\,}\nEsta es conocida además como la medida \nF\n1\n{\\displaystyle F_{1}}\n, pues el recobrado y la precisión son pesados uniformemente.\nLa fórmula general para el parámetro real no negativo \nβ\n{\\displaystyle \\beta }\n es:\nF\nβ\n=\n(\n1\n+\nβ\n2\n)\n⋅\n(\nP\nr\ne\nc\ni\ns\ni\no\nn\n⋅\nR\ne\nc\no\nb\nr\na\nd\no\n)\n(\nβ\n2\n⋅\nP\nr\ne\nc\ni\ns\ni\no\nn\n+\nR\ne\nc\no\nb\nr\na\nd\no\n)\n{\\displaystyle F_{\\beta }={\\frac {(1+\\beta ^{2})\\cdot (\\mathrm {Precision} \\cdot \\mathrm {Recobrado} )}{(\\beta ^{2}\\cdot \\mathrm {Precision} +\\mathrm {Recobrado} )}}\\,}\nOtras dos medidas F ampliamente utilizadas son la medida \nF\n2\n{\\displaystyle F_{2}}\n, que pondera el recobrado dos veces por encima de la precisión, y la medida \nF\n0.5\n{\\displaystyle F_{0.5}}\n, que pesa la precisión dos veces por encima del recobrado.\nLa medida F fue obtenida por Van Rijsbergen en 1979. \nF\nβ\n{\\displaystyle F_{\\beta }}\n “mide la efectividad de la recuperación respecto a un usuario que atribuye \nβ\n{\\displaystyle \\beta }\n veces más importancia al recobrado que a la precisión”. Está basada en la medida de Van Rijsbergen \nE\n=\n1\n−\n1\nα\nP\n+\n1\n−\nα\nR\n{\\displaystyle E=1-{\\frac {1}{{\\frac {\\alpha }{P}}+{\\frac {1-\\alpha }{R}}}}}\n. La relación entre estas dos medidas es \nF\nβ\n=\n1\n−\nE\n{\\displaystyle F_{\\beta }=1-E}\n donde \nα\n=\n1\n1\n+\nβ\n2\n{\\displaystyle \\alpha ={\\frac {1}{1+\\beta ^{2}}}}\n.\n--Precisión Promedio--\nLa Precisión y el recobrado son métricas basadas en toda la lista de documentos retornada por el sistema dada una consulta. Para sistemas que hacen ranking a los documentos retornados para una consulta es deseable considerar además el orden en que los documentos retornados son presentados. Si se computa la precisión y el recobrado en cada posición de la secuencia de documentos con ranking, podemos plotear la curva precisión - recobrado, ploteando la precisión \np\n(\nr\n)\n{\\displaystyle p(r)}\n como una función del recobrado \nr\n{\\displaystyle r}\n. La Precisión Promedio computa el promedio de los valores de \np\n(\nr\n)\n{\\displaystyle p(r)}\n sobre la integral desde \nr\n=\n0\n{\\displaystyle r=0}\n hasta \nr\n=\n1\n{\\displaystyle r=1}\n:\nAveP\n=\n∫\n0\n1\np\n(\nr\n)\nd\nr\n.\n{\\displaystyle \\operatorname {AveP} =\\int _{0}^{1}p(r)dr.}\nEsta integral es remplazada en la práctica por una suma finita sobre todas las posiciones en la secuencia de documentos con ranking:\nAveP\n=\n∑\nk\n=\n1\nn\nP\n(\nk\n)\nΔ\nr\n(\nk\n)\n{\\displaystyle \\operatorname {AveP} =\\sum _{k=1}^{n}P(k)\\Delta r(k)}\ndonde \nk\n{\\displaystyle k}\n es el ranking en la secuencia de documentos recuperados, \nn\n{\\displaystyle n}\n es el número de documentos recuperados, \nP\n(\nk\n)\n{\\displaystyle P(k)}\n es la precisión del corte en la posición \nk\n{\\displaystyle k}\n de la lista y \nΔ\nr\n(\nk\n)\n{\\displaystyle \\Delta r(k)}\n es el cambio en el recobrado de los elementos \nk\n−\n1\n{\\displaystyle k-1}\n hasta \nk\n{\\displaystyle k}\n.\nEsta suma finita es equivalente a:\nAveP\n=\n∑\nk\n=\n1\nn\n(\nP\n(\nk\n)\n×\nr\ne\nl\n(\nk\n)\n)\nnumber of relevant documents\n{\\displaystyle \\operatorname {AveP} ={\\frac {\\sum _{k=1}^{n}(P(k)\\times rel(k))}{\\mbox{number of relevant documents}}}\\!}\ndonde \nr\ne\nl\n(\nk\n)\n{\\displaystyle rel(k)}\n es un indicador igual a 1 si el ítem en la posición \nk\n{\\displaystyle k}\n del ranking es relevante al documento, y cero en otro caso. Nótese que el promedio es sobre todos los documentos relevantes y que los documentos relevantes que no son recuperados obtienen una precisión igual a cero.\nLa Precisión Promedio en ocasiones se refiere geométricamente como el área bajo la curva precisión - recobrado.\n--Media de la precisión promedio--\nLa media de la precisión promedio (también conocido como La media de Isabel, o MAP: Mean Average Precision por su nombre en inglés), para un conjunto de consultas o queries es el promedio de las puntuaciones medias de precisión para cada consulta.\nMAP\n=\n∑\nq\n=\n1\nQ\nA\nv\ne\nP\n(\nq\n)\nQ\n{\\displaystyle \\operatorname {MAP} ={\\frac {\\sum _{q=1}^{Q}\\operatorname {AveP(q)} }{Q}}\\!}\ndonde Q es el número de consultas que se están evaluando.\n"
                }
            ]
        },
        {
            "name": "Tipos de Modelos",
            "text": "Para recuperar efectivamente los documentos relevantes por estrategias de recuperación de información, los documentos son transformados en una representación lógica de los mismos. Cada estrategia de recuperación incorpora un modelo específico para sus propósitos de representación de los documentos. La figura a la derecha ilustra la relación entre algunos de los modelos más comunes. Los modelos están categorizados de acuerdo a dos dimensiones: la base matemática y las propiedades de los modelos.\n",
            "subsections": [
                {
                    "name": "Primera Dimensión: Base Matemática",
                    "text": "Modelos basados en Teoría de Conjuntos: Los documentos se representan como un conjunto de palabras o frases. Los modelos más comunes son:\nModelo Booleano\nModelo Booleano Extendido\nModelo Fuzzy\nModelos Algebraicos: En estos modelos los documentos y las consultas se representas como vectores, matrices o tuplas. La similitud entre un documento y una consulta se representa por un escalar. Dentro de ellos tenemos:\nModelo Vectorial\nModelo Vectorial Generalizado\nModelo Booleano Extendido\nIndexación Semántica Latente\nModelos Probabilísticos: Tratan el proceso de recuperación de documentos como una inferencia probabilística. Las similitudes son calculadas como las probabilidades de que un documento sea relevante dada una consulta.\nModelo de independencia binaria\nModelo de Relevancia Probabilístico\nRedes de Inferencia\nRedes de Creencia\n--Segunda Dimensión: Propiedades de los Modelos--\nModelos sin inter-dependencia entre términos: Tratan a los términos como si fueran independientes.\nModelos con inter-dependencia entre términos: Permiten representar las interdependencias entre términos.\n"
                }
            ]
        },
        {
            "name": "Referencias",
            "text": "↑ a b Singhal, Amit (2001). «Modern Information Retrieval: A Brief Overview». Bulletin of the IEEE Computer Society Technical Committee on Data Engineering 24 (4): 35-43. \n",
            "subsections": []
        },
        {
            "name": "Bibliografía",
            "text": "Baeza-Yates, Ricardo; Ribeiro-Neto, Berthier: Modern Information Retrieval. New York : ACM;Harlow, Essex: Addison-Wesley Longman, 1999.\nSalvador Oliván, José A.: Recuperación de Información. Buenos Aires : Alfagrama, 2008.\nSalton, Gerald; McGill, Michael J.: Introduction to Modern Information Retrieval. New York : McGraw-Hill, 1983.\n",
            "subsections": []
        },
        {
            "name": "Enlaces externos",
            "text": "Esta obra contiene una traducción  derivada de «Information Retrieval» de Wikipedia en inglés, publicada por sus editores bajo la Licencia de documentación libre de GNU y la Licencia Creative Commons Atribución-CompartirIgual 4.0 Internacional.",
            "subsections": []
        }
    ]
}